app/views/users/index.html.erb

        <td><%= user.email %></td>
        <td><%= !user.microposts.last.nil? ? user.microposts.last.content : "No posts for this user" %></td>
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]